
<h3>1. С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную $str.</h3>

<?php
function ol_todo_1() {
	$str = '';

	for ( $i = 1; $i < 10; $i++ ) {
		$str .= $i;
	}

	echo $str;
}

ol_todo_1();
?>

<h3>2. С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную $str.</h3>

<?php
function ol_todo_2() {
	$str = '';

	for ( $i = 9; $i > 0; $i-- ) {
		$str .= $i;
	}

	echo $str;
}

ol_todo_2();
?>

<h3>3. С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную $str.</h3>

<?php
function ol_todo_3() {
	$str = '-';

	for ( $i = 1; $i < 10; $i++ ) {
		$str .= $i . '-';
	}

	echo $str;
}

ol_todo_3();
?>

<h3>4. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов.</h3>

<?php
function ol_todo_4() {
	for ( $i = 1; $i <= 20; $i++ ) {
		echo str_repeat( 'x', $i ) . '<br>';
	}
}

ol_todo_4();
?>

<h3>5. С помощью двух вложенных циклов нарисуйте следующую пирамидку:</h3>

<?php
function ol_todo_5() {
	for ( $i = 1; $i <= 9; $i++ ) {

		for ( $n = 0; $n < $i; $n++ ) {
			echo $i;
		}

		echo '<br>';
	}
}

ol_todo_5();
?>

<h3>6. Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for:</h3>

<?php
function ol_todo_6() {
	for ( $i = 1; $i <= 10; $i++ ) {
		echo str_repeat( 'x', ++$i ) . '<br>';
	}
}

ol_todo_6();
?>
